# MST (Prim, Kruskal)  # 모든 정점들을 최소 비용으로 연결
# 최단 경로 (Dijkstra)  # 최소 비용으로 목적지까지 가기
# 제발 헷갈리지 마세요!


## MST (Prim, Kruskal) : 방법만 다를 뿐 결과는 같음,, 모든 정점들을 연결한다

# Prim : MST를 만들어가는 알고르즘
# 1. 임의의 정점을 선택 (시작 정점)
# 2. 선택한 정점들에서 연결되는 간선 중에 최소비용 간선 선택
# 3. 최소비용 간선을 선택하면 하나의 새로운 정점이 선택
# 4. 2-3을 모든 정점이 선택될 때까지 반복

# Kruskal : MST를 만드는 알고리즘
# 1. 간선 비용기준 오름차순 정렬
# 2. 비용이 작은 간선부터 선택
# 3. 단, 간선을 선택하는 과정에서 '사이클'이 발생하면 해당간선은 선택하지 않음
#    (정점을 같은 간선을 두 번 지나지 않고 되돌아 올 수 있으면)
# 4. 모든 정점을 선택하면 MST 완성

## 최단 경로 (Dijkstra)

# Dijkstra
# 1. 시작점에서 다른 정점까지 가는 비용계산
# 2. 그 중에서 가장 작은 비용이면 경로 확정
# 3. 그 경로로 다른 정점까지 가는 비용 계산해보고, 더 작으면 수정...
# 4. 목적지까지 비용이 확정될 때까지 1 - 3 반복